app/controllers/templates_controller.rb

  def index
    @templates = Template.all
---
SELECT "templates".* FROM "templates"

  def show
    @template = Template.find(params[:id])
---
SELECT "templates".* FROM "templates" WHERE "templates"."id" = 1 LIMIT 1

  def create
    @template = Template.new(params[:template])

    respond_to do |format|
      if @template.save
---
INSERT INTO "templates" ("title", "body", "description", "created_at", "updated_at") VALUES ('test', 'test', 'test', '2011-08-18 12:35:56.156227', '2011-08-18 12:35:56.156227')