app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_hash", "password_salt", "name", "created_at", "updated_at") VALUES ('test@gmail.com', '$2a$10$tcIzi37wrihh4KFjBf8eZ.4Z0rIfG4hlt6NXHoHPManKKjfT5ac9u', '$2a$10$tcIzi37wrihh4KFjBf8eZ.', 'test', '2011-08-18 12:23:05.995499', '2011-08-18 12:23:05.995499')
---
  def create
    @user = User.new(params[:user])
    if @user.save